#include "CTitleStringUI.h"

/*********************************************
*		タイトル文章UIクラス.
*******************/
CTitleStringUI::CTitleStringUI()
{
	//初期化処理関数.
	Init();
}

CTitleStringUI::~CTitleStringUI()
{
	//解放処理関数.
	Release();
}

//=========================================.
//		更新処理関数.
//=========================================.
void CTitleStringUI::Update()
{

}

//=========================================.
//		描画処理関数.
//=========================================.
void CTitleStringUI::Render()
{
	
}

//==========================================.
//		初期化処理関数.
//==========================================.
void CTitleStringUI::Init()
{

}

//==========================================.
//		解放処理関数.
//==========================================.
void CTitleStringUI::Release()
{

}