#include "CLowEvaluationStage.h"

/***********************************************
*		低評価のステージクラス.
*****************/
CLowEvaluationStage::CLowEvaluationStage()
{
	//初期化処理関数.
	Init();
}

CLowEvaluationStage::~CLowEvaluationStage()
{
	//解放処理関数.
	Release();
}

//===============================================.
//		更新処理関数.
//===============================================.
void CLowEvaluationStage::Update()
{

}

//================================================.
//		描画処理関数.
//================================================.
void CLowEvaluationStage::Render()
{

}

//================================================.
//		初期化処理関数.
//================================================.
void CLowEvaluationStage::Init()
{

}

//================================================.
//		解放処理関数.
//================================================.
void CLowEvaluationStage::Release()
{

}