#include "CCameraBase.h"

/**************************************
*		カメラ基底クラス.
**************/
CCameraBase::CCameraBase()
{
	//初期化処理関数.
	Init();
}

CCameraBase::~CCameraBase()
{
	//解放処理関数.
	Release();
}

//==============================================.
//		更新処理関数.
//==============================================.
void CCameraBase::Update()
{

}

//==============================================.
//		ゲームメインステージの初期化処理関数.
//==============================================.
void CCameraBase::InitGameMainStage()
{
}

//==============================================.
//		お化けが話すステージの初期化処理関数.
//==============================================.
void CCameraBase::InitGhostSpeakStage()
{
	m_Camera.vPos = D3DXVECTOR3(5.0f, 2.5f, -3.5f);
	m_Camera.vLook = D3DXVECTOR3(5.0f, 2.5f, 5.0f);
}

//==============================================.
//		エンディングの初期化処理関数.
//==============================================.
void CCameraBase::InitEnding()
{

}

//==============================================.
//		初期化処理関数.
//==============================================.
void CCameraBase::Init()
{

}

//==============================================.
//		解放処理関数.
//==============================================.
void CCameraBase::Release()
{

}