#include "CArrow.h"

/**********************************************
*			矢印クラス.
*****************/
CArrow::CArrow()
{
	//初期化処理関数.
	Init();
}

CArrow::~CArrow()
{
	//解放処理関数.
	Release();
}

//=============================================.
//		更新処理関数.
//=============================================.
void CArrow::Update()
{

}

//=============================================.
//		初期化処理関数.
//=============================================.
void CArrow::Init()
{
	for (int arrow = 0; arrow < 2; arrow++) {
		m_pCSpriteUI.push_back(m_pCResourceManager->GetSpriteUI(enSpriteUI::Arrow));
	}
}

//=============================================.
//		解放処理関数.
//=============================================.
void CArrow::Release()
{

}