#include "CWhiteScreenFade.h"

/******************************************
*		白スクリーンフェードクラス.
************/
CWhiteScreenFade::CWhiteScreenFade()
{

}

CWhiteScreenFade::~CWhiteScreenFade()
{

}

//=========================================.
//		更新処理化数.
//=========================================.
void CWhiteScreenFade::Update()
{

}

//=========================================.
//		描画処理関数.
//=========================================.
void CWhiteScreenFade::Render()
{

}

//=========================================.
//		初期化処理関数.
//=========================================.
void CWhiteScreenFade::Init()
{

}

//=========================================.
//		解放処理関数.
//=========================================.
void CWhiteScreenFade::Release()
{

}