#include "CSurpriseEffect.h"

/*****************************************
*		驚きエフェクト.
*******************/
CSurpriseEffect::CSurpriseEffect()
{
	//初期化処理関数.
	Init();
}

CSurpriseEffect::~CSurpriseEffect()
{
	//解放処理関数.
	Release();
}

//============================================.
//		更新処理関数.
//============================================.
void CSurpriseEffect::Update()
{

}

//=============================================.
//		描画処理関数.
//=============================================.
void CSurpriseEffect::Render()
{

}

//=============================================.
//		初期化処理関数.
//=============================================.
void CSurpriseEffect::Init()
{

}

//==============================================.
//		解放処理関数.
//==============================================.
void CSurpriseEffect::Release()
{

}