#include "CSleepEffect.h"

/********************************************
*		寝ているエフェクトクラス.
****************/
CSleepEffect::CSleepEffect()
{
	//初期化処理関数.
	Init();
}

CSleepEffect::~CSleepEffect()
{
	//解放処理関数.
	Release();
}

//===================================.
//		更新処理関数.
//===================================.
void CSleepEffect::Update()
{

}

//===================================.
//		初期化処理関数.
//===================================.
void CSleepEffect::Init()
{

}

//====================================.
//		解放処理関数.
//====================================.
void CSleepEffect::Release()
{

}