#include "CBackstageLight.h"

/*******************************************
*		舞台裏のライトクラス.
************/
CBackstageLight::CBackstageLight()
{
	//初期化処理関数.
	Init();
}

CBackstageLight::~CBackstageLight()
{
	//解放処理関数.
	Release();
}

//=========================================.
//		更新処理関数.
//=========================================.
void CBackstageLight::Update()
{

}

//=========================================.
//		初期化処理関数.
//=========================================.
void CBackstageLight::Init()
{

}

//=========================================.
//		解放処理関数.
//=========================================.
void CBackstageLight::Release()
{

}