#include "CCameraTitle.h"

/*******************************************
*		タイトルカメラクラス.
*************/
CCameraTitle::CCameraTitle()
{
	//初期化処理関数.
	Init();
}

CCameraTitle::~CCameraTitle()
{
	//解放処理関数.
	Release();
}

//==========================================.
//		更新処理関数.
//==========================================.
void CCameraTitle::Update()
{

}

//==========================================.
//		初期化処理関数.
//==========================================.
void CCameraTitle::Init()
{
	m_Camera.vPos = D3DXVECTOR3(11.9f, 7.5f, -19.9f);
	m_Camera.vLook = D3DXVECTOR3(11.9f, 5.3f, 4.0f);
}

//==========================================.
//		解放処理関数.
//==========================================.
void CCameraTitle::Release()
{

}